app/controllers/posts_controller.rb

INSERT INTO "posts" ("blob", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["blob", "jjhk"], ["user_id", 12], ["created_at", "2017-03-14 15:17:41.244662"], ["updated_at", "2017-03-14 15:17:41.244662"]]
---
  def create
    post = Post.new(post_params)
    unless post.save