app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    user = User.find_by(:provider => auth.provider,
                        :uid => auth.uid) || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("provider", "uid", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["provider", "facebook"], ["uid", "1361318110595188"], ["name", "Sakshi Jain"], ["created_at", "2017-03-14 04:35:18.530548"], ["updated_at", "2017-03-14 04:35:18.530548"]]
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? LIMIT 1  [["provider", "facebook"], ["uid", "1"]]